<?php
/**
 * alltosun.com  
 * ============================================================================
 * 版权所有 (C) 2009-2013 北京互动阳光科技有限公司，并保留所有权利。
 * 网站地址: http://www.alltosun.com
 * ----------------------------------------------------------------------------
 * 许可声明：这是一个开源程序，未经许可不得将本软件的整体或任何部分用于商业用途及再发布。
 * ============================================================================
 * szy: 宋志宇 (songzy@alltosun.com)
 * 2018年5月2日: 2016-7-26 下午3:05:10
 * Id
 */


class file_apply_config {

   

    public static $record_tables= array(
            '0'=>'集团文件',
            '1'=>'门店改造申请',
            
    );

    //允许上传的文件类型
    public static $allow_type  = array(
        '0' => 'jpg',
        '1' => 'png',
        '2' => 'gif',
        '3' => 'jpeg',
        '4' => 'doc',
        '5' => 'msword',
        '6' => 'msoffice', //ppt Excel word
        '7' => 'xlsx',
        '8' => 'csv',
        '9' => 'mp3',
        '10'=> 'mp4',
        '11' =>  'ppt',
        '12' =>  'doc',
        '13' => 'xls',
        '14' => 'pptx',
        '15' => 'pdf',
        '16' => 'zip',
        '17' => 'docx',
        '18' => 'zip.msoffice'
    );
    
    public static $store_type =array(
            '1' => '一级厅',
            '2' => '二级厅',
            '3' => '三级厅',
            '4' => '四级厅',
            '5' => '五级厅',
            '6' => '其他',
    );
    public static $plan_type =array(
            '0' => '门头',
            '1' => '入门',
            '2' => '业务办理',
            '3' => '终端体验',
            '4' => '交付区',
    );
}
?>