<?php
/**
 * alltosun.com 主页面 like_config.php
 * ============================================================================
 * 版权所有 (C) 2009-2018 北京互动阳光科技有限公司，并保留所有权利。
 * 网站地址: http://www.alltosun.com
 * ----------------------------------------------------------------------------
 * 许可声明：这是一个开源程序，未经许可不得将本软件的整体或任何部分用于商业用途及再发布。
 * ============================================================================
 * $Author: 赵高举 (zhaogj@alltosun.com) $
 * $Date: 2018/4/12 11:48 $
 * $Id$
 */
class like_config
{
    /**
     * 文章模型列表
     * @var array
     */
    public static $module = array(
        'qydev_news' => '新闻分享',
    );

    /**
     * 文章状态
     * @var array
     */
    public static $status = array(
        '1' => '已发布',
        '2' => '未发布'
    );

    /**
     * 评论列表状态
     * @var array
     */
    public static $comment_status = array(
        '0' => "全部",
        '1' => "通过",
        '2' => "未通过",
        '3' => "已回复",
        '4' => "未回复"
    );
}