<?php
/**
 * alltosun.com 重定向下 防止页面空白报错 index.php
 * ============================================================================
 * 版权所有 (C) 2009-2013 北京互动阳光科技有限公司，并保留所有权利。
 * 网站地址: http://www.alltosun.com
 * ----------------------------------------------------------------------------
 * 许可声明：这是一个开源程序，未经许可不得将本软件的整体或任何部分用于商业用途及再发布。
 * ============================================================================
 * $Author: 郭剑峰 (guojf@alltosun.com) $
 * $Date: 2018-2-28 下午3:13:40 $
 * $Id$
 */

class Action
{
    public function __call($action = '', $param = array())
    {
        $url = AnUrl('screen_device/admin/device');

        Response::redirect($url);
        Response::flush();
        exit();
    }
}