<?php

/**
 * alltosun.com 开放平台的接口类的基础类 base.php
 * ============================================================================
 * 版权所有 (C) 2009-2012 北京互动阳光科技有限公司，并保留所有权利。
 * 网站地址: http://www.alltosun.com
 * ----------------------------------------------------------------------------
 * 许可声明：这是一个开源程序，未经许可不得将本软件的整体或任何部分用于商业用途及再发布。
 * ============================================================================
 * $Author: 宁海新 (ninghx@alltosun.com) $
 * $Date: 2012-9-18 上午10:29:34 $
 * $Id: base.php 643 2013-02-07 12:16:41Z anr $
*/

/**
 * 开放平台的接口类的基础类
 * @author nignhx@alltosun.com
 * @package AnOpenApi
 */
interface AnOpenApiWrapper
{
    /**
     * 授权
     */
    public function authorize();

    /**
     * 回调函数
     */
    public function callback($code);
}
?>