<?php
/**
 * alltosun.com  screen_auto_config.php
 * ============================================================================
 * 版权所有 (C) 2009-2013 北京互动阳光科技有限公司，并保留所有权利。
 * 网站地址: http://www.alltosun.com
 * ----------------------------------------------------------------------------
 * 许可声明：这是一个开源程序，未经许可不得将本软件的整体或任何部分用于商业用途及再发布。
 * ============================================================================
 * $Author: 郭剑峰 (guojf@alltosun.com) $
 * $Date: 2018-2-6 上午10:47:45 $
 * $Id$
 */

class screen_auto_config
{
    // 自启动的状态记录
    public static  $auto_type = array(
            0 => '未启动',
            1 => '自启动',
            2 => '关机',
    );

    public static  $detail = array(
            0 => '失败<br>未启动',
            1 => '成功',
            2 => '失败<br>关机',
            99 => '--<br>未上报'
    );

    public static $search = array(
            0 => 'auto_start',
            1 => 'business_hall_title',
            2 => 'load'
            
    );
}