<?php
/**
 * alltosun.com  
 * ============================================================================
 * 版权所有 (C) 2009-2013 北京互动阳光科技有限公司，并保留所有权利。
 * 网站地址: http://www.alltosun.com
 * ----------------------------------------------------------------------------
 * 许可声明：这是一个开源程序，未经许可不得将本软件的整体或任何部分用于商业用途及再发布。
 * ============================================================================
 * szy: 宋志宇 (songzy@alltosun.com)
 * 2018年3月7日: 2016-7-26 下午3:05:10
 * Id
 */
class factory_config
{
    // 扩展字段
    
    // 电话
    const EXTEND_PHONE = 'phone';
    // 邮箱
    const EXTEND_EMAIL = 'email';
    
    /**
     * mac外部导入、手写
     */
    public static $device_add_code=array(
    
            '1'    => '手动填写mac(label_id)',
    
            '2'    => '从外部导入'
    
      
    );
    
    public static $company=array(
            '1' => '圆通',
            '2' => '申通',
            '3' => '韵达',
            '4' => '顺丰',
            '5' => '中通',
            '6' => 'EMS',
            '7' => '宅急送',
            '8' => '全峰',
            '9' => '天天',
            '10' => '包裹',
            '11' => '汇通',
            '12' => '优速',
    );
    public static $search_type = array(
            0 => '全部',
            1 => '探针',
            2 => 'rfid',
    );

    
}