<?php
/**
 * alltosun.com  screen_device_confing.php
 * ============================================================================
 * 版权所有 (C) 2009-2013 北京互动阳光科技有限公司，并保留所有权利。
 * 网站地址: http://www.alltosun.com
 * ----------------------------------------------------------------------------
 * 许可声明：这是一个开源程序，未经许可不得将本软件的整体或任何部分用于商业用途及再发布。
 * ============================================================================
 * szy: 宋志宇 (songzy@alltosun.com)
 * 2017年12月8日: 2016-7-26 下午3:05:10
 * Id
 */

class screen_device_config
{
    public static $is_status = array(
            '0' =>  "全部",
            '1' =>  "通过",
            '2' =>  "未通过"

    );

    /**
     *  设备版本号
     * @var unknown
     */
    public static $version_no = array(
            '1.0.0',
            '1.0.1',
            '2.0.0',
            '2.0.1',
            '2.0.2',
            '2.1.0',
            '2.1.1',
            '2.1.2',
            '2.1.3',
            '2.2.0',
            '2.3.0', // 往下的可以去screen_device_version_record 查找
    );

    /**
     * 上架下架记录表中的type值定义
     * @var unknown
     */
    public static $offline_type = array(
            '2' => '自动下架',
            '3' => '手动下架',
            '102' => '自动上架',
            '103' => '手动上架',
    );
}