<?php
/**
 * alltosun.com 测试方法 test.php
 * ============================================================================
 * 版权所有 (C) 2009-2013 北京互动阳光科技有限公司，并保留所有权利。
 * 网站地址: http://www.alltosun.com
 * ----------------------------------------------------------------------------
 * 许可声明：这是一个开源程序，未经许可不得将本软件的整体或任何部分用于商业用途及再发布。
 * ============================================================================
 * $Author: 郭剑峰 (guojf@alltosun.com) $
 * $Date: 2018-1-20 下午6:09:01 $
 * $Id$
 */

class Action
{
    public function index()
    {
        p('{"user_id":"00000000_alltsoun","an_id":"1101021002051","analog_i":"1101021002051","business":"\u897f\u5355\u8425\u4e1a\u5385","t_name":"\u897f\u5355\u8425\u4e1a\u5385","account":"1101021002051"}');
        exit();
//       
    }
}