<?php
/**
 * alltosun.com  screen_photo_config.php
 * ============================================================================
 * 版权所有 (C) 2009-2013 北京互动阳光科技有限公司，并保留所有权利。
 * 网站地址: http://www.alltosun.com
 * ----------------------------------------------------------------------------
 * 许可声明：这是一个开源程序，未经许可不得将本软件的整体或任何部分用于商业用途及再发布。
 * ============================================================================
 * $Author: 郭剑峰 (guojf@alltosun.com) $
 * $Date: 2018-1-19 下午12:43:51 $
 * $Id$
 */
class screen_photo_config
{
    // 这个是对应数据表字段status
    public static $status = array(
            0 => '待合图',
            1 => '已合图',
            2 => '合图失败',
            3 => '源数据存在问题',
            4 => '机型不存在',
    );
}