<?php
/**
 * alltosun.com  faq_config.php
 * ============================================================================
 * 版权所有 (C) 2009-2013 北京互动阳光科技有限公司，并保留所有权利。
 * 网站地址: http://www.alltosun.com
 * ----------------------------------------------------------------------------
 * 许可声明：这是一个开源程序，未经许可不得将本软件的整体或任何部分用于商业用途及再发布。
 * ============================================================================
 * $Author: 郭剑峰 (guojf@alltosun.com) $
 * $Date: 2017-11-25 下午8:11:55 $
 * $Id$
 */
class faq_config
{
    public static $screen_diff_question = array(
            1 => '安装APP',
            2 => '开机不启动',
            3 => '亮屏消失了',
            4 => '发布价格'
    );

    /**
     * 站内外链接状态
     */
    public static $site_type =array(
    
            '0'=>'外部链接',
            '1'=>'新建详情页',
    );
}