<?php
/**
 * alltosun.com  apply.php
 * ============================================================================
 * 版权所有 (C) 2009-2013 北京互动阳光科技有限公司，并保留所有权利。
 * 网站地址: http://www.alltosun.com
 * ----------------------------------------------------------------------------
 * 许可声明：这是一个开源程序，未经许可不得将本软件的整体或任何部分用于商业用途及再发布。
 * ============================================================================
 * $Author: 郭剑峰 (guojf@alltosun.com) $
 * $Date: 2017-6-30 上午11:02:34 $
 * $Id$
 */

class apply_widget
{
    public function check_is_exist_departs($params)
    {
        if (!is_array($params)) { 
            return '请以数组的形式传值';
        }

    }
}