<?php

/**
 * alltosun.com 封装Smarty3 Smarty3.php
 * ============================================================================
 * 版权所有 (C) 2007-2009 北京互动阳光科技有限公司，并保留所有权利。
 * 网站地址: http://www.alltosun.com
 * ----------------------------------------------------------------------------
 * 许可声明：这是一个开源程序，未经许可不得将本软件的整体或任何部分用于商业用途及再发布。
 * ============================================================================
 * $Author: 高竞竞 (gaojj@alltosun.com) $
 * $Date: 2010-11-12 上午10:36:59 $
 * $Id: Smarty3.php 143 2012-02-02 17:25:16Z gaojj $
*/

require_once AnPHP::$dir_3rd.'/Smarty3/libs/Smarty.class.php';

class Smarty3 extends Smarty
{

}
?>