<?php 
/**
 * alltosun.com  probe_rule.php
 * ============================================================================
 * 版权所有 (C) 2009-2015 北京互动阳光科技有限公司，并保留所有权利。
 * 网站地址: http://www.alltosun.com
 * ----------------------------------------------------------------------------
 * 许可声明: 这是一个开源程序，未经许可不得将本软件的整体或任何部分用于商业用途及再发布。
 * ============================================================================
 * $Author: 王磊 (wangl@alltosun.com) $
 * $Date: 2017-5-31 下午12:32:32 $
*/

/**
 * 探针规则接口
 *
 * @author wangl
 */
interface probe_rule
{
    /**
     * 获取营业厅规则
     *
     * @param   Int 营业厅ID
     */
    public function get_rule($b_id);
}
?>