<?php 
/**
 * alltosun.com  probe_db.php
 * ============================================================================
 * 版权所有 (C) 2009-2015 北京互动阳光科技有限公司，并保留所有权利。
 * 网站地址: http://www.alltosun.com
 * ----------------------------------------------------------------------------
 * 许可声明: 这是一个开源程序，未经许可不得将本软件的整体或任何部分用于商业用途及再发布。
 * ============================================================================
 * $Author: 王磊 (wangl@alltosun.com) $
 * $Date: 2017-5-31 下午12:31:10 $
*/

/**
 * 探针数据库接口
 *
 * @author wangl
 */
interface probe_db
{
    /**
     * 获取数据库对象
     *
     * @param   Array   参数
     */
    public function get_db($param = array());
}
?>