<?php 
/**
 * alltosun.com  probe_cache.php
 * ============================================================================
 * 版权所有 (C) 2009-2015 北京互动阳光科技有限公司，并保留所有权利。
 * 网站地址: http://www.alltosun.com
 * ----------------------------------------------------------------------------
 * 许可声明: 这是一个开源程序，未经许可不得将本软件的整体或任何部分用于商业用途及再发布。
 * ============================================================================
 * $Author: 王磊 (wangl@alltosun.com) $
 * $Date: 2017-5-31 下午12:31:55 $
*/

/**
 * 探针缓存接口
 *
 * @author wangl
 */
interface probe_cache
{
    /**
     * 设置数据缓存
     *
     * @param   Array   参数
     */
    public function set_cache($param = array());

    /**
     * 获取数据缓存
     *
     * @param   Array   参数
    */
    public function get_cache($param = array());
}
?>