<?php
/**
 * alltosun.com 登录模块 login.php
* ============================================================================
* 版权所有 (C) 2009-2013 北京互动阳光科技有限公司，并保留所有权利。
* 网站地址: http://www.alltosun.com
* ----------------------------------------------------------------------------
* 许可声明：这是一个开源程序，未经许可不得将本软件的整体或任何部分用于商业用途及再发布。
* ============================================================================
* $Author: 申小宁 (shenxn@alltosun.com) $
* $Date: 2016-1-7 上午11:19:22 $
* $Id$
*/

class Action
{
    public function __call($action = '', $params = array())
    {
        echo 123;

        _widget('stat')->add_stat_data(array('res_name' => 'home_page','event' => 'view'));
    }

}