<?php
/**
 * alltosun.com  screen_stat_config.php
 * ============================================================================
 * 版权所有 (C) 2009-2013 北京互动阳光科技有限公司，并保留所有权利。
 * 网站地址: http://www.alltosun.com
 * ----------------------------------------------------------------------------
 * 许可声明：这是一个开源程序，未经许可不得将本软件的整体或任何部分用于商业用途及再发布。
 * ============================================================================
 * $Author: 郭剑峰 (guojf@alltosun.com) $
 * $Date: 2018-1-3 下午3:15:06 $
 * $Id$
 */

class screen_stat_config
{
    public static $res_name_arr = array(
            'group',
            'province',
            'city',
            'area',
            'business_hall'
    );
    
    public static $behave_type = [
        'all' => '全部',
        '离开主界面',
        '进入主界面',
        '每小时心跳',
        '设备关机',
        '设备开机',
        '上报历史',
        '10分钟心跳',
        '设备信息'
    ];
    public static $netstate = [
        0 => '无网络链接',
        1 => '有网络链接无法联通外网',
        2 => '有网络链接可以联通外网',
    ];
    public static $behave_admin_type = [
        1 => '按设备',
        2 => '按门店'
    ];
    
}